## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for sandboxy environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"] will be updated in-place
  ~ resource "kubectl_manifest" "cdi_operator" {
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"
        name                    = "cdis.cdi.kubevirt.io"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for cluster-api environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["MachineDeployment-testing-cluster-machinedeploy-workers-clusters"] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_api_manifests" {
      ~ object   = {
          ~ spec       = {
              ~ selector                = {
                  ~ matchLabels      = {
                      - "cluster.x-k8s.io/cluster-name"    = "testing-cluster"
                      - "cluster.x-k8s.io/deployment-name" = "testing-cluster-machinedeploy-workers"
                    } -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
                # (10 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["ProxmoxMachineTemplate-testing-cluster-control-plane-template-clusters"] is tainted, so must be replaced
-/+ resource "kubernetes_manifest" "cluster_api_manifests" {
      ~ object   = {
          ~ metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
                name                       = "testing-cluster-control-plane-template"
              ~ ownerReferences            = [
                  - {
                      - apiVersion         = "cluster.x-k8s.io/v1beta1"
                      - blockOwnerDeletion = null
                      - controller         = null
                      - kind               = "Cluster"
                      - name               = "testing-cluster"
                      - uid                = "ea93d304-fb54-44ce-9b56-aac60fff6793"
                    },
                ] -> (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec       = {
              ~ template = {
                  ~ metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  ~ spec     = {
                      + allowedNodes     = (known after apply)
                      + description      = (known after apply)
                      ~ network          = {
                          + additionalDevices = (known after apply)
                          ~ default           = {
                              + dnsServers  = (known after apply)
                              ~ ipv4PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              ~ ipv6PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              + mtu         = (known after apply)
                              + vlan        = (known after apply)
                                # (2 unchanged attributes hidden)
                            }
                          + vrfs              = (known after apply)
                        }
                      + pool             = (known after apply)
                      + providerID       = (known after apply)
                      + snapName         = (known after apply)
                      + storage          = (known after apply)
                      + tags             = (known after apply)
                      + target           = (known after apply)
                      ~ templateSelector = {
                          + matchTags = (known after apply)
                        }
                      + virtualMachineID = (known after apply)
                      ~ vmIDRange        = {
                          + end   = (known after apply)
                          + start = (known after apply)
                        }
                        # (10 unchanged attributes hidden)
                    }
                }
            }
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["ProxmoxMachineTemplate-testing-cluster-worker-template-clusters"] is tainted, so must be replaced
-/+ resource "kubernetes_manifest" "cluster_api_manifests" {
      ~ object   = {
          ~ metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
                name                       = "testing-cluster-worker-template"
              ~ ownerReferences            = [
                  - {
                      - apiVersion         = "cluster.x-k8s.io/v1beta1"
                      - blockOwnerDeletion = null
                      - controller         = null
                      - kind               = "Cluster"
                      - name               = "testing-cluster"
                      - uid                = "ea93d304-fb54-44ce-9b56-aac60fff6793"
                    },
                ] -> (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec       = {
              ~ template = {
                  ~ metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  ~ spec     = {
                      + allowedNodes     = (known after apply)
                      + description      = (known after apply)
                      ~ network          = {
                          + additionalDevices = (known after apply)
                          ~ default           = {
                              + dnsServers  = (known after apply)
                              ~ ipv4PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              ~ ipv6PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              + mtu         = (known after apply)
                              + vlan        = (known after apply)
                                # (2 unchanged attributes hidden)
                            }
                          + vrfs              = (known after apply)
                        }
                      + pool             = (known after apply)
                      + providerID       = (known after apply)
                      + snapName         = (known after apply)
                      + storage          = (known after apply)
                      + tags             = (known after apply)
                      + target           = (known after apply)
                      ~ templateSelector = {
                          + matchTags = (known after apply)
                        }
                      + virtualMachineID = (known after apply)
                      ~ vmIDRange        = {
                          + end   = (known after apply)
                          + start = (known after apply)
                        }
                        # (10 unchanged attributes hidden)
                    }
                }
            }
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["TalosConfigTemplate-testing-cluster-talosconfig-workers-clusters"] is tainted, so must be replaced
-/+ resource "kubernetes_manifest" "cluster_api_manifests" {
      ~ object   = {
          ~ metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
                name                       = "testing-cluster-talosconfig-workers"
              ~ ownerReferences            = [
                  - {
                      - apiVersion         = "cluster.x-k8s.io/v1beta1"
                      - blockOwnerDeletion = null
                      - controller         = null
                      - kind               = "Cluster"
                      - name               = "testing-cluster"
                      - uid                = "ea93d304-fb54-44ce-9b56-aac60fff6793"
                    },
                ] -> (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec       = {
              ~ template = {
                  ~ spec = {
                      + data             = (known after apply)
                      ~ hostname         = {
                          + source = (known after apply)
                        }
                      + strategicPatches = (known after apply)
                      + talosVersion     = (known after apply)
                        # (2 unchanged attributes hidden)
                    }
                }
            }
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

  ```
  
  Plan exit code: 0
  